biletbank-updatepassengers/BILETBANK API REQUEST&RESPONSE - V2 BrandedFareItemId - RT RecommendationBox/Airsearch req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:trev="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Base" xmlns:trev1="http://schemas.datacontract.org/2004/07/Trevoo.WS.IO.Shopping" xmlns:trev2="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Air" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
	<soapenv:Header/>
	<soapenv:Body>
		<tem:AirSearch>
			<tem:request>
				<trev:AuthenticationHeader>
					<trev:SessionId>7434204</trev:SessionId>
					<trev:SessionToken>db14f99c-897e-4c51-8599-115813e40836</trev:SessionToken>
				</trev:AuthenticationHeader>
				<trev:ExtraParamList>
					<trev:ExtendedData>
						<trev:Name>BrandedFareVersion</trev:Name>
						<trev:Value>v2</trev:Value>
					</trev:ExtendedData>
				</trev:ExtraParamList>
				<trev1:CreateNewShoppingFile>true</trev1:CreateNewShoppingFile>
				<trev1:Form>
					<trev2:FlightType>RT</trev2:FlightType>
					<trev2:Options>
						<trev2:FlightClass>Economy</trev2:FlightClass>
						<trev2:FlightWithBaggage>false</trev2:FlightWithBaggage>
						<trev2:IfDirectFlightsOnly>false</trev2:IfDirectFlightsOnly>
						<trev2:IfRefundablesOnly>false</trev2:IfRefundablesOnly>
						<trev2:SearchTimeoutMilliseconds>0</trev2:SearchTimeoutMilliseconds>
					</trev2:Options>
					<trev2:PaxItems>
						<trev2:T_AirSearch_PaxItem>
							<trev2:PaxCode>ADT</trev2:PaxCode>
							<trev2:PaxCount>1</trev2:PaxCount>
						</trev2:T_AirSearch_PaxItem>
						<trev2:T_AirSearch_PaxItem>
							<trev2:PaxCode>CHD</trev2:PaxCode>
							<trev2:PaxCount>0</trev2:PaxCount>
						</trev2:T_AirSearch_PaxItem>
						<trev2:T_AirSearch_PaxItem>
							<trev2:PaxCode>INF</trev2:PaxCode>
							<trev2:PaxCount>0</trev2:PaxCount>
						</trev2:T_AirSearch_PaxItem>
					</trev2:PaxItems>
					<trev2:Segments>
						<trev2:T_AirSearch_SegmentItem>
							<trev2:DepartureDay>2025-08-07T00:00:00</trev2:DepartureDay>
							<trev2:Destination>
								<trev2:Code>AMS</trev2:Code>
								<trev2:CountryCode>NL</trev2:CountryCode>
								<trev2:IsCity>false</trev2:IsCity>
								<trev2:Name/>
							</trev2:Destination>
							<trev2:Origin>
								<trev2:Code>IST</trev2:Code>
								<trev2:CountryCode>TR</trev2:CountryCode>
								<trev2:IsCity>true</trev2:IsCity>
								<trev2:Name/>
							</trev2:Origin>
							<trev2:SequenceNo>1</trev2:SequenceNo>
						</trev2:T_AirSearch_SegmentItem>
						<trev2:T_AirSearch_SegmentItem>
							<trev2:DepartureDay>2025-08-10T00:00:00</trev2:DepartureDay>
							<trev2:Destination>
								<trev2:Code>IST</trev2:Code>
								<trev2:CountryCode>TR</trev2:CountryCode>
								<trev2:IsCity>true</trev2:IsCity>
								<trev2:Name/>
							</trev2:Destination>
							<trev2:Origin>
								<trev2:Code>AMS</trev2:Code>
								<trev2:CountryCode>NL</trev2:CountryCode>
								<trev2:IsCity>false</trev2:IsCity>
								<trev2:Name/>
							</trev2:Origin>
							<trev2:SequenceNo>2</trev2:SequenceNo>
						</trev2:T_AirSearch_SegmentItem>
					</trev2:Segments>
				</trev1:Form>
			</tem:request>
		</tem:AirSearch>
	</soapenv:Body>
</soapenv:Envelope>